01  WS-AREA-1.          PIC X(100). 
01  WS-AREA-2.          PIC 9(5) VALUE 0. 
01  WS-NUMERIC-AREA.   PIC 9(5).

PROCEDURE DIVISION.
    MOVE 'some data' TO WS-AREA-1
    IF WS-AREA-1 NUMERIC THEN
        MOVE WS-AREA-1 TO WS-NUMERIC-AREA
        ADD WS-NUMERIC-AREA TO WS-AREA-2
    ELSE
        DISPLAY "Error: Non-numeric data encountered." 
    END-IF
    DISPLAY WS-AREA-1 WS-AREA-2
    STOP RUN.